{
  "backend/main.mo": "Actor managing user profiles with authorization checks and a public contact form system storing timestamped submissions.",
  "feature_evidence.json": "Feature evidence report mapping branding, title, and logo update requirements to affected frontend files.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend files, their roles, and updated Quick bee Agency branding.",
  "frontend/index.css": "Tailwind base file defining OKLCH theme variables, dark mode overrides, and global background/foreground styling.",
  "frontend/index.html": "HTML entry containing root mount point and updated Quick bee Agency document title.",
  "frontend/src/App.tsx": "Sets up TanStack Router with layout and five primary routes for the site.",
  "frontend/src/components/layout/Footer.tsx": "Footer component showing brand logo, navigation links, service links, and contact options.",
  "frontend/src/components/layout/HeaderNav.tsx": "Responsive header with logo, navigation links, mobile menu, and CTA button using siteConfig.",
  "frontend/src/components/layout/SiteLayout.tsx": "Layout wrapper rendering header, dynamic page content, and footer.",
  "frontend/src/components/marketing/CtaBlock.tsx": "Reusable CTA block with title, description, and primary/secondary action buttons.",
  "frontend/src/components/marketing/FaqAccordion.tsx": "Renders an FAQ accordion with toggling answers using local state and predefined FAQ data.",
  "frontend/src/components/marketing/IconBulletList.tsx": "Displays a list of benefits with icons, titles, and descriptions in a two-column grid.",
  "frontend/src/components/marketing/PlanCard.tsx": "Shows a pricing plan card with features, price, CTA link, and optional popular highlighting.",
  "frontend/src/components/marketing/ProblemStatements.tsx": "Presents a grid of common business problems with icons and styled warning cards.",
  "frontend/src/components/marketing/ServiceCard.tsx": "Displays a service description card with sections for what it is, why it matters, and business impact.",
  "frontend/src/components/marketing/SocialProof.tsx": "Renders testimonials and a case study highlighting business results and improvements.",
  "frontend/src/components/marketing/ThreeStepProcess.tsx": "Shows a three-step process with icons and descriptions explaining the workflow.",
  "frontend/src/components/marketing/ValuePropsGrid.tsx": "Displays a grid of core value items with icons, titles, and descriptions.",
  "frontend/src/components/marketing/WhatsappButton.tsx": "Provides a styled WhatsApp contact button linking to the configured WhatsApp URL.",
  "frontend/src/config/site.ts": "Exports site configuration including name, descriptions, WhatsApp details, contact info, and CTAs.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages a backend actor based on user identity, refetching dependent queries when changed.",
  "frontend/src/hooks/useContactForm.ts": "Provides a mutation hook to submit contact form data through the backend actor and invalidate related queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, including login state, stored identities, and helper hooks.",
  "frontend/src/hooks/useQueries.ts": "Exports a minimal wrapper for react-query, intended as a place to add future query hooks.",
  "frontend/src/index.css": "Defines Tailwind base layers and custom CSS variables for theming, including color palettes, dark mode, and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission text, value propositions, and marketing sections describing the company's approach.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with validation and submission via useContactForm, plus marketing sections and WhatsApp contact option.",
  "frontend/src/pages/HomePage.tsx": "Displays the home page with hero content, benefits, pricing highlights, and multiple marketing components.",
  "frontend/src/pages/PricingPage.tsx": "Shows pricing tiers, ROI benefits, and marketing sections using PlanCard components.",
  "frontend/src/pages/ServicesPage.tsx": "React page that renders a services list with marketing copy and a hero section using ServiceCard, CtaBlock, and siteConfig.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters and sessionStorage-backed values.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, container settings, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata describing the website’s goals, theme, features, requirements, and known issues."
}