{
  "backend/main.mo": "Motoko backend handling user profile access with authorization checks plus public contact-form submissions stored with timestamps and admin-only retrieval.",
  "feature_evidence.json": "Feature evidence report mapping WhatsApp‑related requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing all major frontend files, pages, components, and configuration.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables, light/dark themes, and global utility resets.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Router setup defining root layout and routes for Home, Services, About, Pricing, and Contact pages.",
  "frontend/src/components/forms/InternationalPhoneInput.tsx": "Country‑select phone input combining dial codes with user‑typed numbers using UI select and input components.",
  "frontend/src/components/layout/Footer.tsx": "Footer with branding, navigation links, contact info, and dynamic year and attribution data.",
  "frontend/src/components/layout/HeaderNav.tsx": "Responsive header with logo, navigation links, and a mobile menu toggle.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapper including header, footer, and routed content area.",
  "frontend/src/components/marketing/CtaBlock.tsx": "Centered call-to-action block with title, description, and primary/secondary buttons.",
  "frontend/src/components/marketing/FaqAccordion.tsx": "Expandable FAQ list with toggleable answers and animated icons.",
  "frontend/src/components/marketing/IconBulletList.tsx": "Grid of benefit items each with an icon, title, and description.",
  "frontend/src/components/marketing/PlanCard.tsx": "Pricing plan card showing details, features, and a CTA, with optional 'most popular' styling.",
  "frontend/src/components/marketing/ProblemStatements.tsx": "Grid of highlighted business problems displayed with destructive-styled icons.",
  "frontend/src/components/marketing/ServiceCard.tsx": "Card describing a service with sections for what it is, why it matters, and business impact.",
  "frontend/src/components/marketing/SocialProof.tsx": "Section showing testimonials and a case study with before/after metrics.",
  "frontend/src/components/marketing/ThreeStepProcess.tsx": "Three‑step process explaining lead capture, automation, and conversion.",
  "frontend/src/components/marketing/ValuePropsGrid.tsx": "Grid of core value items with icons, titles, and descriptions.",
  "frontend/src/components/marketing/WhatsappButton.tsx": "WhatsApp CTA button linking to a configured chat URL.",
  "frontend/src/config/site.ts": "Defines marketing site metadata including name, description, WhatsApp numbers, contact info, and CTA labels.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useContactForm.ts": "Provides a mutation for submitting contact form data through the actor and tracks submission state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, loading, login, logout, and identity state handling.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future query hooks using the actor.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for colors, themes, and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the app with React, QueryClient, and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission details, value props, and marketing sections using siteConfig.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with validation, submission via actor, and optional WhatsApp follow‑up link.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage with hero section, benefits, pricing plans, and various marketing components.",
  "frontend/src/pages/PricingPage.tsx": "Renders the pricing page with three plan tiers and an ROI benefits section using PlanCard components. Most logic defines static plan/ROI data and displays them in styled sections.",
  "frontend/src/pages/ServicesPage.tsx": "Displays a list of service offerings with descriptions and business impact using ServiceCard components. Contains static structured service data and a styled hero section.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, persist, and clear URL parameters, including support for hash-based routing and sessionStorage. Includes logic to prioritize URL values and sanitize the address bar.",
  "frontend/src/utils/whatsappLink.ts": "Generates a normalized WhatsApp deep link by cleaning the phone number and URL-encoding the message text.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, and responsive container settings, and loading typography, container-queries, and animation plugins.",
  "project_state.json": "Project metadata defining current features, new WhatsApp integration request, and state tracking for routing contact-form details to specific WhatsApp numbers."
}