{
  "backend/main.mo": "Motoko canister handling user profiles with access control and storing public contact form submissions with admin-only retrieval.",
  "feature_evidence.json": "Feature evidence report linking a WhatsApp deep‑link update to specific frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend file’s purpose across pages, components, config, and hooks.",
  "frontend/index.css": "Tailwind base/theme setup defining OKLCH color tokens, dark mode variables, and global element styles.",
  "frontend/index.html": "Minimal HTML shell loading the React app via main.tsx and providing the root container.",
  "frontend/src/App.tsx": "Defines TanStack Router routes and renders the app within the shared SiteLayout.",
  "frontend/src/components/forms/InternationalPhoneInput.tsx": "A phone input component combining country dial code selection with a text input for full international numbers.",
  "frontend/src/components/layout/Footer.tsx": "Footer layout showing branding, navigation links, services, and contact info using site configuration data.",
  "frontend/src/components/layout/HeaderNav.tsx": "Responsive header with logo, navigation links, and a mobile toggle menu using router state.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapper that renders header, footer, and routed content via Outlet.",
  "frontend/src/components/marketing/CtaBlock.tsx": "Marketing CTA section with title, description, and primary/secondary action links.",
  "frontend/src/components/marketing/FaqAccordion.tsx": "Expandable FAQ accordion with toggleable questions and answers.",
  "frontend/src/components/marketing/IconBulletList.tsx": "Lists business benefits with icons, titles, and descriptions in a styled grid.",
  "frontend/src/components/marketing/PlanCard.tsx": "Pricing plan card showing features, pricing details, and a CTA, with optional 'popular' styling.",
  "frontend/src/components/marketing/ProblemStatements.tsx": "Displays common business problems in a two-column grid with icons.",
  "frontend/src/components/marketing/ServiceCard.tsx": "Service description card outlining what it is, why it matters, and business impact.",
  "frontend/src/components/marketing/SocialProof.tsx": "Testimonials and a case study block showing business results and social proof.",
  "frontend/src/components/marketing/ThreeStepProcess.tsx": "Three-step process section illustrating key stages with icons and descriptions.",
  "frontend/src/components/marketing/ValuePropsGrid.tsx": "Grid of core value props with icons, titles, and descriptions.",
  "frontend/src/components/marketing/WhatsappButton.tsx": "Stylized WhatsApp button linking to a chat URL with customizable label.",
  "frontend/src/config/site.ts": "Defines site-wide config including branding, contact info, WhatsApp numbers, and CTA labels.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and invalidates queries when it changes.",
  "frontend/src/hooks/useContactForm.ts": "Provides a mutation hook to submit contact form data through the backend actor and track submission state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context with login, logout, identity loading, and status management.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future React Query hooks; currently imports useActor only.",
  "frontend/src/index.css": "Tailwind base styles with custom color variables, dark mode settings, and utility classes for teal glows and gradients.",
  "frontend/src/main.tsx": "App entry point initializing React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission, values, differentiators, and marketing components using siteConfig.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with validation, backend submission, and WhatsApp message link generation.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage with hero section, pricing plans, benefits, and multiple marketing components.",
  "frontend/src/pages/PricingPage.tsx": "Renders the pricing page with predefined plan data, ROI points, and layout sections using PlanCard components.",
  "frontend/src/pages/ServicesPage.tsx": "Displays a list of service offerings with descriptions and benefits, rendered through ServiceCard components and a marketing layout.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, retrieving, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/src/utils/whatsappLink.ts": "Generates WhatsApp deep links and formats contact form data into a structured WhatsApp message.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom themes, colors, animations, plugins, and container settings.",
  "project_state.json": "Stores project metadata, existing features, and pending requests related to improving WhatsApp contact form message formatting."
}