{
  "backend/main.mo": "Backend actor managing user profiles with access control and handling contact form submissions including WhatsApp notification attempts.",
  "feature_evidence.json": "Feature evidence report listing two ContactPage-related features, their affected files, components, tests, and confidence.",
  "frontend-file-summaries.txt": "Text file containing prewritten one-line summaries for numerous frontend files across layout, pages, components, and hooks.",
  "frontend/index.css": "Tailwind base styles defining global OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML shell loading the app root and main React entrypoint.",
  "frontend/src/App.tsx": "Sets up the TanStack Router with main routes wrapped in the SiteLayout component.",
  "frontend/src/components/forms/InternationalPhoneInput.tsx": "React component for country-selectable international phone input using custom UI components.",
  "frontend/src/components/layout/Footer.tsx": "Footer component showing branding, navigation links, contact section, and dynamic attribution.",
  "frontend/src/components/layout/HeaderNav.tsx": "Responsive header navigation with logo, desktop links, and a mobile toggle menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapper adding header, footer, and routed content outlet.",
  "frontend/src/components/marketing/CtaBlock.tsx": "Marketing CTA block with title, description, and primary/secondary action buttons.",
  "frontend/src/components/marketing/FaqAccordion.tsx": "Expandable FAQ accordion listing common questions and answers.",
  "frontend/src/components/marketing/IconBulletList.tsx": "Displays a grid of benefits with icons, titles, and descriptions.",
  "frontend/src/components/marketing/PlanCard.tsx": "Pricing plan card with features, pricing details, and CTA, supporting a 'popular' highlight state.",
  "frontend/src/components/marketing/ProblemStatements.tsx": "Shows a list of common business problems styled with destructive indicators.",
  "frontend/src/components/marketing/ServiceCard.tsx": "Service description card outlining what it is, why it matters, and its business impact.",
  "frontend/src/components/marketing/SocialProof.tsx": "Section showcasing testimonials and a case study with before/after metrics.",
  "frontend/src/components/marketing/ThreeStepProcess.tsx": "Displays a three-step process with icons, numbers, and descriptions.",
  "frontend/src/components/marketing/ValuePropsGrid.tsx": "Grid of value propositions with icons, titles, and descriptions.",
  "frontend/src/components/marketing/WhatsappButton.tsx": "WhatsApp action button linking to a chat URL with customizable label.",
  "frontend/src/config/site.ts": "Defines site metadata, WhatsApp/contact details, and CTA labels.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useContactForm.ts": "Provides a mutation hook to submit contact form data through the actor and invalidates related queries on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context and provider for authentication, identity loading, and login state handling.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future query hooks using the actor.",
  "frontend/src/index.css": "Tailwind setup defining global styles, color variables, dark mode, and custom utility classes.",
  "frontend/src/main.tsx": "Initializes React root and wraps the app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission, value props, and marketing content using site configuration.",
  "frontend/src/pages/ContactPage.tsx": "Implements the contact form with backend submission, WhatsApp link generation, and popup‑safe window handling.",
  "frontend/src/pages/HomePage.tsx": "Landing page rendering hero content, benefits, pricing plans, and multiple marketing components for lead-generation automation.",
  "frontend/src/pages/PricingPage.tsx": "Displays tiered pricing plans, ROI points, and marketing sections with PlanCards and CTA components.",
  "frontend/src/pages/ServicesPage.tsx": "Shows a list of service offerings with descriptions and impacts, wrapped in a marketing-focused layout.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters with session persistence and hash support.",
  "frontend/src/utils/whatsappLink.ts": "Generates WhatsApp deep links and formats contact form data into a structured WhatsApp message.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, containers, animations, and plugin setup.",
  "project_state.json": "Project metadata describing WhatsApp popup-blocking issues, existing feature requirements, and architectural notes."
}