{
  "backend/main.mo": "Actor with access control managing user profiles and a public contact form, storing submissions with timestamps.",
  "backend/migration.mo": "Migration module that returns the provided state unchanged.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files used as reference metadata.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark color systems and global styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with main site routes wrapped in SiteLayout.",
  "frontend/src/components/layout/Footer.tsx": "Footer showing brand info, navigation links, services list, and contact options including phone link.",
  "frontend/src/components/layout/HeaderNav.tsx": "Responsive header with logo, navigation links, mobile menu, and CTA button.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapper rendering header, footer, and routed page content.",
  "frontend/src/components/marketing/CtaBlock.tsx": "Renders a call‑to‑action block with title, description, and primary/optional secondary CTA links.",
  "frontend/src/components/marketing/FaqAccordion.tsx": "Displays an accordion-style FAQ list with expandable questions and answers.",
  "frontend/src/components/marketing/IconBulletList.tsx": "Shows a grid of benefits, each with an icon, title, and description.",
  "frontend/src/components/marketing/PlanCard.tsx": "Displays a pricing plan card with features, pricing, CTA, and optional popular badge.",
  "frontend/src/components/marketing/ProblemStatements.tsx": "Lists common business problems using styled cards with icons.",
  "frontend/src/components/marketing/ServiceCard.tsx": "Shows a service description card detailing what it is, why it matters, and business impact.",
  "frontend/src/components/marketing/SocialProof.tsx": "Displays testimonials and a case study highlighting business results.",
  "frontend/src/components/marketing/ThreeStepProcess.tsx": "Renders a three‑step process section with icons, numbers, titles, and descriptions.",
  "frontend/src/components/marketing/ValuePropsGrid.tsx": "Shows a grid of core value cards with icons, titles, and descriptions.",
  "frontend/src/components/marketing/WhatsappButton.tsx": "Provides a styled WhatsApp link button using site configuration.",
  "frontend/src/config/site.ts": "Exports global site configuration including name, contact info, WhatsApp details, and CTA text.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useContactForm.ts": "Provides a mutation hook to submit contact forms through the actor with status tracking.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using AuthClient, including login, logout, and identity restoration.",
  "frontend/src/hooks/useQueries.ts": "Sets up a placeholder for React Query hooks, currently importing useQuery and useActor for future expansion.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode overrides, and custom utility classes for teal glows and gradients.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission details, value propositions, and sections highlighting the company’s differentiators.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with state handling and submission via useContactForm, alongside marketing content and WhatsApp CTA.",
  "frontend/src/pages/HomePage.tsx": "Displays the home page with hero, benefits, pricing previews, and multiple marketing components for lead generation.",
  "frontend/src/pages/PricingPage.tsx": "Shows pricing plans with features, an ROI section, and calls to action, using reusable PlanCard and marketing components.",
  "frontend/src/pages/ServicesPage.tsx": "Renders the Services page with a list of service objects plus marketing components and a hero section layout.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugin setup.",
  "project_state.json": "Tracks project state, existing features, pending feature requests, and metadata for the site’s development tasks."
}