{
  "backend/main.mo": "Actor implementing user profiles with access control plus a public contact form storing timestamped submissions.",
  "feature_evidence.json": "Feature evidence report specifying an email-update feature and related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all frontend files in the project.",
  "frontend/index.css": "Tailwind base theme with extensive OKLCH color variables for light/dark modes and global element styling.",
  "frontend/index.html": "HTML entry file mounting the React app and setting the site title.",
  "frontend/src/App.tsx": "Configures TanStack Router with main routes wrapped by the shared SiteLayout.",
  "frontend/src/components/layout/Footer.tsx": "Footer displaying brand, navigation links, services, and contact info using siteConfig values.",
  "frontend/src/components/layout/HeaderNav.tsx": "Responsive header with logo, navigation links, CTA button, and mobile menu toggle.",
  "frontend/src/components/layout/SiteLayout.tsx": "Layout wrapper rendering HeaderNav, page content via Outlet, and Footer.",
  "frontend/src/components/marketing/CtaBlock.tsx": "Reusable call‑to‑action section with title, description, and primary/secondary CTA links.",
  "frontend/src/components/marketing/FaqAccordion.tsx": "Accordion component that displays a list of FAQs with toggleable answers.",
  "frontend/src/components/marketing/IconBulletList.tsx": "Renders a two-column grid of benefit items with icons, titles, and descriptions.",
  "frontend/src/components/marketing/PlanCard.tsx": "Pricing plan card showing plan details, features, and a CTA, with styling for popular plans.",
  "frontend/src/components/marketing/ProblemStatements.tsx": "Section listing common business problems in styled cards with destructive icons.",
  "frontend/src/components/marketing/ServiceCard.tsx": "Displays a service with sections for what it is, why it matters, and its business impact.",
  "frontend/src/components/marketing/SocialProof.tsx": "Shows testimonials and a case study with before/after metrics to demonstrate results.",
  "frontend/src/components/marketing/ThreeStepProcess.tsx": "Presents a three-step process with icons, step numbers, titles, and descriptions.",
  "frontend/src/components/marketing/ValuePropsGrid.tsx": "Grid layout highlighting core values with icons, titles, and descriptions.",
  "frontend/src/components/marketing/WhatsappButton.tsx": "Simple WhatsApp CTA button linking to the configured contact number.",
  "frontend/src/config/site.ts": "Site configuration object defining metadata, contact info, WhatsApp link, and CTA labels.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor, handling identity changes and query invalidation.",
  "frontend/src/hooks/useContactForm.ts": "Hook for submitting contact form data via the backend actor with mutation handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Placeholder for query hooks using React Query, currently minimal and ready for future additions.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for theming, including light/dark modes and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission details, values, and marketing sections.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form page with form state, submission handling, and marketing layout.",
  "frontend/src/pages/HomePage.tsx": "Builds the home page with hero content, benefits, pricing highlights, and various marketing components.",
  "frontend/src/pages/PricingPage.tsx": "Displays pricing plans, ROI details, and supporting marketing sections for the pricing page.",
  "frontend/src/pages/ServicesPage.tsx": "React page that renders a services list with marketing cards and a hero section.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "JSON metadata describing project state, feature requests, issues, and version info."
}