{
  "backend/main.mo": "Main canister handles user profiles, contact form submissions, and server-side WhatsApp notifications via HTTP outcalls with authorization checks.",
  "backend/migration.mo": "Provides migration logic converting old contact submissions to a new format with WhatsApp notification status fields.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test mappings for WhatsApp automation updates.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend components, pages, config files, and utilities.",
  "frontend/index.css": "Global Tailwind-based styles defining color tokens, dark mode variables, and base UI styling.",
  "frontend/index.html": "HTML entry point that loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and renders the app within a shared site layout.",
  "frontend/src/components/forms/InternationalPhoneInput.tsx": "Phone input component with country selector and dial code support using UI select and input elements.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with brand info, navigation links, services links, and contact options.",
  "frontend/src/components/layout/HeaderNav.tsx": "Provides a responsive header with logo, navigation links, active-state highlighting, and a mobile menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps the page with a header, footer, and main content outlet.",
  "frontend/src/components/marketing/CtaBlock.tsx": "Displays a call‑to‑action section with title, description, and primary/secondary CTA buttons.",
  "frontend/src/components/marketing/FaqAccordion.tsx": "Implements an accordion-style FAQ list with expandable answers.",
  "frontend/src/components/marketing/IconBulletList.tsx": "Shows a benefits list with icons, titles, and descriptions in a two-column layout.",
  "frontend/src/components/marketing/PlanCard.tsx": "Renders a pricing plan card with features, pricing details, and an optional 'most popular' badge.",
  "frontend/src/components/marketing/ProblemStatements.tsx": "Displays a grid of common business problems with icons and highlighted styling.",
  "frontend/src/components/marketing/ServiceCard.tsx": "Presents a service description with sections for what it is, why it matters, and business impact.",
  "frontend/src/components/marketing/SocialProof.tsx": "Shows testimonials and a case study highlighting business results and improvements.",
  "frontend/src/components/marketing/ThreeStepProcess.tsx": "Renders a three-step marketing section with icons, titles, and descriptions to explain the lead generation process.",
  "frontend/src/components/marketing/ValuePropsGrid.tsx": "Displays a grid of value propositions with icons, titles, and descriptions passed via props.",
  "frontend/src/components/marketing/WhatsappButton.tsx": "Provides a styled WhatsApp CTA button using a default or custom link and label.",
  "frontend/src/config/site.ts": "Defines site-wide configuration including branding, WhatsApp info, contact details, and CTA labels.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useContactForm.ts": "Provides a mutation hook to submit contact form data through the backend actor and manages related query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for managing login state, stored identities, and auth client creation.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future React Query hooks, currently only imports dependencies.",
  "frontend/src/index.css": "Defines Tailwind base layers, custom color variables, and utility classes including teal glow and gradients.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider and renders the root component.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with hero content, mission text, value props, and sections describing the company’s differentiators.",
  "frontend/src/pages/ContactPage.tsx": "React contact form page handling validation, submission, and generating WhatsApp links after successful form send.",
  "frontend/src/pages/HomePage.tsx": "Marketing-focused homepage displaying hero content, benefits, pricing plans, and CTAs using various components.",
  "frontend/src/pages/PricingPage.tsx": "Pricing page showing tiered plans, ROI highlights, and marketing CTAs.",
  "frontend/src/pages/ServicesPage.tsx": "Services overview page listing detailed service descriptions and business impact sections with CTAs.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/src/utils/whatsappLink.ts": "Generates WhatsApp deep links and formats contact form data into prefilled WhatsApp messages.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines project state, goals, issues, and feature requests for implementing automated WhatsApp delivery and related observability."
}