{
  "kind": "build_request",
  "title": "Improve WhatsApp prefilled message text from Contact form (include all client details)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-4",
      "text": "Update the WhatsApp deep-link prefilled text generated after a successful contact form submission so it includes every contact form field (name, email, phone, message) in a clear, copy/paste-friendly format for fast replies, and always targets the dedicated contact-form WhatsApp number from configuration (siteConfig.whatsapp.contactFormNumber).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "make the text of your messege in contact form to reach the whatsapp number i provided with every details in contact form as the data of client so i can reply them fast"
        ]
      },
      "acceptanceCriteria": [
        "After submitting the Contact form successfully, clicking \"Continue on WhatsApp\" opens a wa.me link that uses siteConfig.whatsapp.contactFormNumber (not the general site WhatsApp number).",
        "The prefilled WhatsApp message includes labeled lines for Name, Email, Phone, and Message.",
        "If the user did not enter a phone number, the message still includes a Phone line with a clear placeholder (e.g., \"Phone: Not provided\").",
        "The WhatsApp message formatting uses line breaks so each field is easy to scan in WhatsApp."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui or any other paths listed as immutable in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not change backend contact-form storage or admin retrieval behavior.",
    "Do not add any new third-party WhatsApp API integration; keep using wa.me deep links only."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}