{
  "kind": "build_request",
  "title": "Send contact form details to WhatsApp (+919181768591) and keep site WhatsApp chat (+919182768591)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the contact form success flow so that the WhatsApp message prefill (containing the submitted contact-form details) is sent to WhatsApp number +919181768591 instead of using the site’s default WhatsApp number.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "make the details entered in contact form to reach the whatsapp number (+919181768591)"
        ]
      },
      "acceptanceCriteria": [
        "After a successful contact form submission, the rendered WhatsApp CTA opens a wa.me link targeting +919181768591.",
        "The WhatsApp prefilled message includes the submitted fields (name, email, optional phone, message) as it does today."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Keep the website’s general WhatsApp integration pointing to +919182768591 for standard “Chat on WhatsApp” buttons/links (header/footer/contact info), while still allowing the contact-form-details WhatsApp CTA to target +919181768591.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "integrate the whatsapp of +919182768591 to the website to read the detals entered in contact form"
        ]
      },
      "acceptanceCriteria": [
        "The default WhatsApp button (e.g., on the Contact page “Prefer to Chat?” section and other global WhatsApp links) continues to open a WhatsApp chat to +919182768591.",
        "The WhatsApp CTA shown after form submission (with prefilled details) targets +919181768591 (and not +919182768591).",
        "The implementation does not break existing WhatsApp link generation (still uses the existing WhatsApp deep link format)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Centralize both WhatsApp numbers in frontend configuration so they are not hard-coded in page components, and use English labels for any user-facing text related to WhatsApp CTAs.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "integrate the whatsapp of +919182768591 to the website to read the detals entered in contact form"
        ]
      },
      "acceptanceCriteria": [
        "Both +919181768591 and +919182768591 are represented in a single configuration source (e.g., frontend/src/config/site.ts) and consumed by the Contact page logic.",
        "No new user-facing text is introduced in a non-English language."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only).",
    "Do not edit immutable hook files: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Respect the existing single-actor backend architecture; no additional backend canisters/services."
  ],
  "nonGoals": [
    "Implementing WhatsApp Business API/webhook-based delivery or automated reading of messages inside WhatsApp (not possible with wa.me links).",
    "Adding new admin UI to view contact submissions in the website.",
    "Changing backend persistence or schema for contact submissions."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}