{
  "kind": "build_request",
  "title": "Prevent WhatsApp auto-open from being blocked after contact form submission",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Contact page submission flow so WhatsApp opens reliably without triggering browser popup-blocking by ensuring the new tab/window is created directly from the user’s submit click (before any async work), then navigating that tab to the generated WhatsApp link after the backend submission succeeds.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "it is showing\"Your browser blocked the automatic WhatsApp window. Click the button below to open WhatsApp with your details\" how to fix this"
        ]
      },
      "acceptanceCriteria": [
        "When the user clicks the form submit button, the app attempts to create a new tab/window immediately from that click event (prior to awaiting the submitContactForm call).",
        "After the submitContactForm call succeeds, the already-opened tab/window is navigated to the WhatsApp deep link created from the submitted form data.",
        "If the browser still blocks window creation, the UI falls back to showing the manual WhatsApp button with the prefilled details link.",
        "No additional WhatsApp window/tab is opened beyond the single intended one per submission."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Adjust the blocked-popup UX messaging on the Contact page to clearly instruct the user what to do next in English, and only show the \"browser blocked\" warning when a popup block is actually detected (not for other errors).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Your browser blocked the automatic WhatsApp window. Click the button below to open WhatsApp with your details"
        ]
      },
      "acceptanceCriteria": [
        "The \"Your browser blocked the automatic WhatsApp window...\" warning is displayed only when the app detects the window/tab could not be created (popup blocked).",
        "If the backend submission fails, the existing error UI is shown and the popup-blocked message is not shown.",
        "All user-facing text added/changed for this flow is in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui (compose existing UI components instead).",
    "Keep the WhatsApp link format generated by frontend/src/utils/whatsappLink.ts (wa.me with URL-encoded text)."
  ],
  "nonGoals": [
    "Implementing real-time messaging or any WhatsApp API integration to send messages directly without user interaction.",
    "Changing backend contact submission schema or adding new backend endpoints solely to address browser popup blocking."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}