{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix WhatsApp auto-open popup blocking on Contact form submission",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Open a single WhatsApp tab/window directly from the submit click, then navigate it to the generated wa.me link only after submission succeeds, with a blocked-popup fallback.",
      "acceptanceCriteria": [
        "When the user clicks the form submit button, the app attempts to create a new tab/window immediately from that click event (prior to awaiting the submitContactForm call).",
        "After the submitContactForm call succeeds, the already-opened tab/window is navigated to the WhatsApp deep link created from the submitted form data.",
        "If the browser still blocks window creation, the UI falls back to showing the manual WhatsApp button with the prefilled details link.",
        "No additional WhatsApp window/tab is opened beyond the single intended one per submission."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Refactor the submit handler to synchronously attempt `window.open('about:blank', '_blank')` from the user click before any async work, keep a reference to that single window/tab, and after `submitForm` resolves successfully, navigate that pre-opened window to the existing WhatsApp deep link generated via `generateWhatsAppLink(...)` + `formatContactFormMessage(...)` (do not change the link format). If the pre-open attempt returns null/invalid or the user closes it before navigation, set state to enable the existing manual `WhatsappButton` fallback; if submission fails, close the pre-opened blank tab (when possible) to avoid leaving an empty tab and ensure no second tab is opened."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Show popup-blocked messaging only when popup blocking is actually detected, and update the English copy to clearly instruct the user.",
      "acceptanceCriteria": [
        "The \"Your browser blocked the automatic WhatsApp window...\" warning is displayed only when the app detects the window/tab could not be created (popup blocked).",
        "If the backend submission fails, the existing error UI is shown and the popup-blocked message is not shown.",
        "All user-facing text added/changed for this flow is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Adjust Contact page state and rendering so the blocked-popup warning block is shown only when the initial synchronous window/tab creation failed (popup blocked) during the submit click. Ensure that on submission errors the error UI remains unchanged and the popup-blocked warning is not displayed (reset/clear the blocked flag on error). Update the warning text to clear English instructions (e.g., tell the user to click the button to open WhatsApp manually) and avoid showing the warning for non-popup-related failures."
        }
      ]
    }
  ]
}